python3 finetune.py

Arguments:
gpu                        0
dataroot                   ../data
output_dir                 ./output
path_to_logs               ./output/logs
batch_size                 4
lr                         0.0003
n_epochs                   1000
patch_size                 256
validate_every             10
print_every                1
save_every                 50

==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Sequential: 1-1                        [-1, 48, 128, 128]        --
|    └─ShiftConv2d: 2-1                  [-1, 48, 256, 256]        --
|    |    └─ZeroPad2d: 3-1               [-1, 3, 257, 256]         --
|    |    └─Crop2d: 3-2                  [-1, 48, 256, 256]        --
|    └─LeakyReLU: 2-2                    [-1, 48, 256, 256]        --
|    └─ShiftConv2d: 2-3                  [-1, 48, 256, 256]        --
|    |    └─ZeroPad2d: 3-3               [-1, 48, 257, 256]        --
|    |    └─Crop2d: 3-4                  [-1, 48, 256, 256]        --
|    └─LeakyReLU: 2-4                    [-1, 48, 256, 256]        --
|    └─Shift2d: 2-5                      [-1, 48, 256, 256]        --
|    |    └─Sequential: 3-5              [-1, 48, 256, 256]        --
|    |    └─ZeroPad2d: 3-6               [-1, 48, 257, 256]        --
|    |    └─Crop2d: 3-7                  [-1, 48, 256, 256]        --
|    └─MaxPool2d: 2-6                    [-1, 48, 128, 128]        --
├─Sequential: 1-2                        [-1, 48, 64, 64]          --
|    └─ShiftConv2d: 2-7                  [-1, 48, 128, 128]        --
|    |    └─ZeroPad2d: 3-8               [-1, 48, 129, 128]        --
|    |    └─Crop2d: 3-9                  [-1, 48, 128, 128]        --
|    └─LeakyReLU: 2-8                    [-1, 48, 128, 128]        --
|    └─Shift2d: 2-9                      [-1, 48, 128, 128]        --
|    |    └─Sequential: 3-10             [-1, 48, 128, 128]        --
|    |    └─ZeroPad2d: 3-11              [-1, 48, 129, 128]        --
|    |    └─Crop2d: 3-12                 [-1, 48, 128, 128]        --
|    └─MaxPool2d: 2-10                   [-1, 48, 64, 64]          --
├─Sequential: 1-3                        [-1, 48, 32, 32]          --
|    └─ShiftConv2d: 2-11                 [-1, 48, 64, 64]          --
|    |    └─ZeroPad2d: 3-13              [-1, 48, 65, 64]          --
|    |    └─Crop2d: 3-14                 [-1, 48, 64, 64]          --
|    └─LeakyReLU: 2-12                   [-1, 48, 64, 64]          --
|    └─Shift2d: 2-13                     [-1, 48, 64, 64]          --
|    |    └─Sequential: 3-15             [-1, 48, 64, 64]          --
|    |    └─ZeroPad2d: 3-16              [-1, 48, 65, 64]          --
|    |    └─Crop2d: 3-17                 [-1, 48, 64, 64]          --
|    └─MaxPool2d: 2-14                   [-1, 48, 32, 32]          --
├─Sequential: 1-4                        [-1, 48, 16, 16]          --
|    └─ShiftConv2d: 2-15                 [-1, 48, 32, 32]          --
|    |    └─ZeroPad2d: 3-18              [-1, 48, 33, 32]          --
|    |    └─Crop2d: 3-19                 [-1, 48, 32, 32]          --
|    └─LeakyReLU: 2-16                   [-1, 48, 32, 32]          --
|    └─Shift2d: 2-17                     [-1, 48, 32, 32]          --
|    |    └─Sequential: 3-20             [-1, 48, 32, 32]          --
|    |    └─ZeroPad2d: 3-21              [-1, 48, 33, 32]          --
|    |    └─Crop2d: 3-22                 [-1, 48, 32, 32]          --
|    └─MaxPool2d: 2-18                   [-1, 48, 16, 16]          --
├─Sequential: 1-5                        [-1, 48, 8, 8]            --
|    └─ShiftConv2d: 2-19                 [-1, 48, 16, 16]          --
|    |    └─ZeroPad2d: 3-23              [-1, 48, 17, 16]          --
|    |    └─Crop2d: 3-24                 [-1, 48, 16, 16]          --
|    └─LeakyReLU: 2-20                   [-1, 48, 16, 16]          --
|    └─Shift2d: 2-21                     [-1, 48, 16, 16]          --
|    |    └─Sequential: 3-25             [-1, 48, 16, 16]          --
|    |    └─ZeroPad2d: 3-26              [-1, 48, 17, 16]          --
|    |    └─Crop2d: 3-27                 [-1, 48, 16, 16]          --
|    └─MaxPool2d: 2-22                   [-1, 48, 8, 8]            --
├─Sequential: 1-6                        [-1, 48, 8, 8]            --
|    └─ShiftConv2d: 2-23                 [-1, 48, 8, 8]            --
|    |    └─ZeroPad2d: 3-28              [-1, 48, 9, 8]            --
|    |    └─Crop2d: 3-29                 [-1, 48, 8, 8]            --
|    └─LeakyReLU: 2-24                   [-1, 48, 8, 8]            --
├─Sequential: 1-7                        [-1, 48, 16, 16]          --
|    └─Upsample: 2-25                    [-1, 48, 16, 16]          --
├─Sequential: 1-8                        [-1, 96, 32, 32]          --
|    └─ShiftConv2d: 2-26                 [-1, 96, 16, 16]          --
|    |    └─ZeroPad2d: 3-30              [-1, 96, 17, 16]          --
|    |    └─Crop2d: 3-31                 [-1, 96, 16, 16]          --
|    └─LeakyReLU: 2-27                   [-1, 96, 16, 16]          --
|    └─ShiftConv2d: 2-28                 [-1, 96, 16, 16]          --
|    |    └─ZeroPad2d: 3-32              [-1, 96, 17, 16]          --
|    |    └─Crop2d: 3-33                 [-1, 96, 16, 16]          --
|    └─LeakyReLU: 2-29                   [-1, 96, 16, 16]          --
|    └─Upsample: 2-30                    [-1, 96, 32, 32]          --
├─Sequential: 1-9                        [-1, 96, 64, 64]          --
|    └─ShiftConv2d: 2-31                 [-1, 96, 32, 32]          --
|    |    └─ZeroPad2d: 3-34              [-1, 144, 33, 32]         --
|    |    └─Crop2d: 3-35                 [-1, 96, 32, 32]          --
|    └─LeakyReLU: 2-32                   [-1, 96, 32, 32]          --
|    └─ShiftConv2d: 2-33                 [-1, 96, 32, 32]          --
|    |    └─ZeroPad2d: 3-36              [-1, 96, 33, 32]          --
|    |    └─Crop2d: 3-37                 [-1, 96, 32, 32]          --
|    └─LeakyReLU: 2-34                   [-1, 96, 32, 32]          --
|    └─Upsample: 2-35                    [-1, 96, 64, 64]          --
├─Sequential: 1-10                       [-1, 96, 128, 128]        --
|    └─ShiftConv2d: 2-36                 [-1, 96, 64, 64]          --
|    |    └─ZeroPad2d: 3-38              [-1, 144, 65, 64]         --
|    |    └─Crop2d: 3-39                 [-1, 96, 64, 64]          --
|    └─LeakyReLU: 2-37                   [-1, 96, 64, 64]          --
|    └─ShiftConv2d: 2-38                 [-1, 96, 64, 64]          --
|    |    └─ZeroPad2d: 3-40              [-1, 96, 65, 64]          --
|    |    └─Crop2d: 3-41                 [-1, 96, 64, 64]          --
|    └─LeakyReLU: 2-39                   [-1, 96, 64, 64]          --
|    └─Upsample: 2-40                    [-1, 96, 128, 128]        --
├─Sequential: 1-11                       [-1, 96, 256, 256]        --
|    └─ShiftConv2d: 2-41                 [-1, 96, 128, 128]        --
|    |    └─ZeroPad2d: 3-42              [-1, 144, 129, 128]       --
|    |    └─Crop2d: 3-43                 [-1, 96, 128, 128]        --
|    └─LeakyReLU: 2-42                   [-1, 96, 128, 128]        --
|    └─ShiftConv2d: 2-43                 [-1, 96, 128, 128]        --
|    |    └─ZeroPad2d: 3-44              [-1, 96, 129, 128]        --
|    |    └─Crop2d: 3-45                 [-1, 96, 128, 128]        --
|    └─LeakyReLU: 2-44                   [-1, 96, 128, 128]        --
|    └─Upsample: 2-45                    [-1, 96, 256, 256]        --
├─Sequential: 1-12                       [-1, 96, 256, 256]        --
|    └─ShiftConv2d: 2-46                 [-1, 96, 256, 256]        --
|    |    └─ZeroPad2d: 3-46              [-1, 99, 257, 256]        --
|    |    └─Crop2d: 3-47                 [-1, 96, 256, 256]        --
|    └─LeakyReLU: 2-47                   [-1, 96, 256, 256]        --
|    └─ShiftConv2d: 2-48                 [-1, 96, 256, 256]        --
|    |    └─ZeroPad2d: 3-48              [-1, 96, 257, 256]        --
|    |    └─Crop2d: 3-49                 [-1, 96, 256, 256]        --
|    └─LeakyReLU: 2-49                   [-1, 96, 256, 256]        --
├─Sequential: 1-13                       [-1, 3, 256, 256]         --
|    └─ShiftConv2d: 2-50                 [-1, 384, 256, 256]       --
|    |    └─ZeroPad2d: 3-50              [-1, 384, 256, 256]       --
|    |    └─Crop2d: 3-51                 [-1, 384, 256, 256]       --
|    └─LeakyReLU: 2-51                   [-1, 384, 256, 256]       --
|    └─ShiftConv2d: 2-52                 [-1, 96, 256, 256]        --
|    |    └─ZeroPad2d: 3-52              [-1, 384, 256, 256]       --
|    |    └─Crop2d: 3-53                 [-1, 96, 256, 256]        --
|    └─LeakyReLU: 2-53                   [-1, 96, 256, 256]        --
├─ShiftConv2d: 1-14                      [-1, 3, 256, 256]         --
├─Sequential: 1                          []                        --
|    └─ShiftConv2d: 2-54                 [-1, 3, 256, 256]         (recursive)
├─ShiftConv2d: 1                         []                        --
|    └─ZeroPad2d: 2-55                   [-1, 96, 256, 256]        --
├─Sequential: 1                          []                        --
|    └─ShiftConv2d: 2                    []                        --
|    |    └─ZeroPad2d: 3-54              [-1, 96, 256, 256]        --
├─ShiftConv2d: 1                         []                        --
|    └─Crop2d: 2-56                      [-1, 3, 256, 256]         --
├─Sequential: 1                          []                        --
|    └─ShiftConv2d: 2                    []                        --
|    |    └─Crop2d: 3-55                 [-1, 3, 256, 256]         --
==========================================================================================
Total params: 0
Trainable params: 0
Non-trainable params: 0
Total mult-adds (G): 29.56
==========================================================================================
Input size (MB): 0.75
Forward/backward pass size (MB): 0.00
Params size (MB): 0.00
Estimated Total Size (MB): 0.75
==========================================================================================

Epoch 0001/1000	Loss 18.715729
Epoch 0002/1000	Loss 12.380178
Epoch 0003/1000	Loss 9.231976
Epoch 0004/1000	Loss 8.642065
Epoch 0005/1000	Loss 10.236919
Epoch 0006/1000	Loss 8.15712
Epoch 0007/1000	Loss 12.561028
Epoch 0008/1000	Loss 11.929369
Epoch 0009/1000	Loss 10.145106
Epoch 0010/1000	Loss 9.896704

Epoch 0010/1000	PSNR 32.180808
